      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOPYBOOK01.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 WS-TM-1                             PIC 99.
       77 WS-TM-2                             PIC 99.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.

       END PROGRAM PROGCOPYBOOK01.
